/* $Id: ru_pronouns.cpp,v 1.1.2.3 2009/10/11 18:35:37 rufina Exp $
 *
 * ruffina, Dream Land, 2007
 */
#include "grammar_entities_impl.h"
#include "ru_pronouns.h"

namespace Grammar {

const IndefinitePronoun::AnimacyCases ru_indefinite_pronouns = 
{
  { "некто", "кого-то", "кому-то", "кого-то", "кем-то", "ком-то" },
  { "нечто", "чего-то", "чему-то", "что-то",  "чем-то", "чем-то" },
};

const PersonalPronoun::Persons ru_personal_pronouns = 
{
  { "я",   "меня", "мне",  "меня", "мной",  "мне"  },
  { "ты",  "тебя", "тебе", "тебя", "тобой", "тебе" },
  { "он",  "него", "ему",  "его",  "ним",   "нем"  },
  { "она", "нее",  "ей",   "ее",   "ею",    "ней"  },
  { "оно", "него", "ему",  "его",  "ним",   "нем"  },
  { "мы",  "нас",  "нам",  "нас",  "нами",  "нас"  },
  { "вы",  "вас",  "вам",  "вас",  "вами",  "вас"  },
  { "они", "них",  "им",   "их",   "ими",   "них"  },
};

const PosessivePronoun::PosessionGenders ru_posessive_pronouns = 
{
  {
      { "мое",  "моего",  "моему",  "мое",  "моим",  "моем"  },
      { "твое", "твоего", "твоему", "твое", "твоим", "твоем" },
      { "его"                                                },
      { "ее"                                                 },
      { "его"                                                },
      { "наше", "нашего", "нашему", "наше", "нашим", "нашем" },
      { "ваше", "вашего", "вашему", "ваше", "вашим", "вашем" },
      { "их"                                                 },
  },
  {
      { "мой",  "моего",  "моему",  "мой",  "моим",  "моем"  },
      { "твой", "твоего", "твоему", "твой", "твоим", "твоем" },
      { "его"                                                },
      { "ее"                                                 },
      { "его"                                                },
      { "наш",  "нашего", "нашему", "наш", "нашим", "нашем"  },
      { "ваш",  "вашего", "вашему", "ваш", "вашим", "вашем"  },
      { "их"                                                 },
  },
  {
      { "моя",  "моей",  "моей",  "мою",  "моей",  "моей"    },
      { "твоя", "твоей", "твоей", "твою", "твоей", "твоей"   },
      { "его"                                                },
      { "ее"                                                 },
      { "его"                                                },
      { "наша", "нашей", "нашей", "нашу", "нашей", "нашей"   },
      { "ваша", "вашей", "вашей", "вашу", "вашей", "вашей"   },
      { "их"                                                 },
  },
  {
      { "мои",  "моих",  "моим",  "моих", "моими",  "моих"   },
      { "твои", "твоих", "твоим", "твои", "твоими", "твоих"  },
      { "его"                                                },
      { "ее"                                                 },
      { "его"                                                },
      { "наши", "наших", "нашим", "наших", "нашими", "наших" },
      { "ваши", "ваших", "вашим", "ваших", "вашими", "ваших" },
      { "их" },
  },
};

const IndefiniteNoun::Pointer 
    somebody(NEW, IndefiniteNoun(ru_indefinite_pronouns, Animacy::PERSON));

const IndefiniteNoun::Pointer 
    something(NEW, IndefiniteNoun(ru_indefinite_pronouns, Animacy::ITEM));

}
